{
  "brownies": [
    {
      "id": 1,
      "image": "./images/malted_brownie_1.jpg",
      "title": "Malted peanut butter brownie",
      "ingredient1": "200g dark chocolate",
      "ingredient2": "125g butter",
      "ingredient3": "3 eggs",
      "ingredient4": "200g caster sugar",
      "ingredient5": "25g cocoa powder",
      "ingredient6": "100g self-raising flour",
      "ingredient7": "25g malted milk powder",
      "ingredient8": "4-6 tbsp smooth peanut butter",
      "method": "Heat oven to 190C/170C fan and line a 20cm square tin with baking paper. Melt the chocolate and butter together in a heatproof bowl set over a pan of simmering water or do this in short bursts in the microwave. Beat the eggs and sugar together in a large bowl using an electric whisk for 3 mins until light and fluffy. Sift over the cocoa, then add the flour and malted milk powder. Fold everything together quickly, then scoop half of the mixture into the tin. Dot over spoonful’s of the peanut butter, then scoop the rest of the brownie mixture over the top and gently ripple the two together using a cutlery knife or skewer. Bake for 30 mins until the brownies are set and slightly cracked on top. Leave to cool in tin then cut into squares.",
      "source": "BBC Good Food Brownie Recipes"
    },
    {
      "id": 2,
      "title": "Chocolate brownie chunks with chocolate dip",
      "image": "./images/brownie_chunk_2.jpg",
      "ingredient1": "200g dark chocolate, broken into chunks",
      "ingredient2": "100g milk chocolate, broken into chunks",
      "ingredient3": "85g butter",
      "ingredient4": "185g muscovado sugar",
      "ingredient5": "3 eggs, at room temperature and lightly beaten",
      "ingredient6": "140g plain flour",
      "ingredient7": "140g walnut, roughly chopped",
      "ingredient8": "200ml natural yogurt",
      "method": "Heat oven to 180C/160C fan and line the base of a 20cm square tin with baking paper. Melt 100g dark chocolate, all of the milk chocolate and the butter in a heatproof bowl over a pan of simmering water. Remove from the heat, then stir in the sugar. Cool a little while you prepare the rest of the ingredients. Stir the eggs into the chocolate mixture, followed by the flour, walnuts and a pinch of salt until really well combined. Pour the mixture into the prepared tin, then bake for 25-30 mins until an inserted skewer comes out with sticky crumbs. Cool in the tin. For the dip, gently melt the remaining chocolate as above, then stir into the yogurt and chill. To serve, cut the brownies into chunks, then spoon the dip into small bowls.",
      "source": "BBC Good Food Brownie Recipes"
    },
    {
      "id": 3,
      "title": "Salted chocolate & hazelnut brownies",
      "image": "./images/hazelnut_brownie_3.jpg",
      "ingredient1": "100g salted butter, cut into small pieces",
      "ingredient2": "200g 70% dark chocolate, broken into chunks",
      "ingredient3": "150g chocolate and hazelnut spread",
      "ingredient4": "3 eggs, beaten",
      "ingredient5": "200g caster sugar",
      "ingredient6": "150g plain flour",
      "ingredient7": "100g toasted pecan nuts, roughly chopped",
      "ingredient8": "Ice cream and caramel sauce, to serve",
      "method": "Heat oven to 180C/160C fan. Grease and line the base and sides of a 20cm square tin. Put the butter, chocolate and chocolate spread in a heatproof bowl and melt over a pan of lightly simmering water. Once melted, stir and set aside to cool a little. In another bowl, use an electric whisk to beat the eggs and sugar together for 5 mins until light and fluffy. Pour in the chocolate mixture and whisk briefly to combine. Sift in the flour and gently fold through the mixture, then add most of the pecans. Scrape the mixture into the tin and spread out with a spatula. Scatter over the last of the pecans and a good sprinkling of sea salt. Bake for 30-35 mins until set but a little gooey in the middle. Cool, then cut into squares and serve with ice cream and caramel sauce.",
      "source": "BBC Good Food Brownie Recipes"
    },
    {
      "id": 4,
      "title": "Microwave brownies",
      "image": "./images/microwave_brownie_4.jpg",
      "ingredient1": "150g salted butter",
      "ingredient2": "150g caster sugar",
      "ingredient3": "1 tsp vanilla extract",
      "ingredient4": "2 tbsp milk",
      "ingredient5": "2 medium eggs, beaten",
      "ingredient6": "50g plain flour",
      "ingredient7": "75g unsweetened cocoa powder",
      "ingredient8": "80g milk chocolate chips",
      "method": "Cut the butter into small pieces. Put in a 20 x 20cm microwavable glass or ceramic dish and cook in 20-second bursts in the microwave until melted. Remove, swirl it around the dish to coat the sides, then tip it into a mixing bowl. Add the sugar to the bowl and, using a hand or electric whisk, whisk vigorously until the mixture is creamy and fully incorporated into the melted butter. In a jug, stir the vanilla extract into the milk along with the beaten eggs. Whisk this, a little at a time, into the sugar and butter mixture, ensuring it’s thoroughly incorporated before adding more. Sift the flour and cocoa powder together, then fold gently into the cake batter. Finally, stir in the milk chocolate chips. Tip the whole mix into the buttered dish and smooth using a spatula to fill the dish. Cook for 5 mins or until the brownies are well-risen and slightly firm to touch. Don’t worry if they’re still a bit soft in the centre; they will continue to cook for several minutes once out of the microwave. Put the hot dish onto a cooling rack and leave for at least 20 mins to firm up. Cut into squares.",
      "source": "BBC Good Food Brownie Recipes"
    },
    {
      "id": 5,
      "title": "Peanut butter microwave brownies",
      "image": "./images/microwave_brownie_5.jpg",
      "ingredient1": "75g butter, plus extra for greasing",
      "ingredient2": "50g peanut butter",
      "ingredient3": "1 egg",
      "ingredient4": "25g cocoa powder",
      "ingredient5": "50g plain flour",
      "ingredient6": "100g sugar",
      "ingredient7": "Few tsp of jam",
      "ingredient8": "Ice cream to serve",
      "method": "Add the butter and peanut butter to a microwave-safe bowl and cook on High for 30 secs to melt. Remove from the microwave and stir thoroughly. Allow to cool slightly then add the egg and stir to combine. Grease with butter and line a second microwaveable round dish (about 15cm wide) with cling film. Tip the peanut butter mix into the lined dish then sieve in the cocoa powder and flour and tip in the sugar. Mix gently to form a thick, sticky paste. Smooth the top of the mixture with the back of a large spoon. Using a teaspoon, make crater-holes in the top of the brownie mixture and fill each generously with jam as it will melt and bubble down when cooked. Pop in the microwave for 3-4 mins on High. Remove and leave to cool for 15 mins (it will carry on cooking as it cools) then enjoy!",
      "source": "BBC Good Food Brownie Recipes"
    },
    {
      "id": 6,
      "title": "Vegan cookies & cream brownies",
      "image": "./images/vegan_brownie_6.jpg",
      "ingredient1": "265g self-raising flour",
      "ingredient2": "245g soft brown sugar",
      "ingredient3": "50g cocoa powder",
      "ingredient4": "1 tsp vanilla extract",
      "ingredient5": "110ml vegetable oil",
      "ingredient6": "1½ tbsp white wine vinegar",
      "ingredient7": "85g dairy-free coconut yogurt",
      "ingredient8": "150g vegan cookies of your choice, broken into chunks",
      "method": "Heat the oven to 170C/150C fan and line a 18cm x 30cm square tin with baking paper. In a bowl mix together the flour, sugar, cocoa and ½ tsp salt. In a jug mix together 125ml water with the vanilla, oil, vinegar and yogurt. Pour the wet ingredients into the dry and mix until smooth and combined. Pour the mix into the tin and smooth the top. Push the chunks of vegan biscuits into the batter, leaving some poking out of the top. Bake for 30-35 mins until set but still squidgy in the middle. Leave to cool in the tin, then cut into squares.",
      "source": "BBC Good Food Brownie Recipes"
    },
    {
      "id": 7,
      "title": "Mince pie brownies",
      "image": "./images/choc_mince_pie_7.jpg",
      "ingredient1": "185g unsalted butter, cubed",
      "ingredient2": "185g high-quality dark chocolate, chopped",
      "ingredient3": "85g plain flour",
      "ingredient4": "40g cocoa powder",
      "ingredient5": "3 large eggs",
      "ingredient6": "275g caster sugar",
      "ingredient7": "6 mince pies or 9-12 mini mince pies",
      "ingredient8": "Icing sugar, for dusting",
      "method": "Melt the butter and chocolate in a medium bowl, either in a microwave – cooking for 1 min on High, then stirring and continuing to heat in 20-second blasts – or by setting the bowl over a pan of simmering water and stirring occasionally. Once melted, leave the mixture to cool. Heat the oven to 180C/160C fan. Line a 20cm square tin with baking paper. Sieve the flour and cocoa into a bowl. Whisk the eggs and sugar with an electric mixer on maximum speed until thick and creamy, about 3-8 mins, or when the mixture runs off the beaters and leaves a trail for a second or two. Pour in the cooled chocolate mixture, then fold together with a rubber spatula in a figure of eight, moving the bowl round until the mixture is a mottled dark brown. Be gentle so you don’t knock out the air. Sift in the cocoa and flour mixture and continue gently folding. The mixture will look dry and dusty, then fudgy. Stop just before you feel you should, as you don’t want to overmix it. Spoon a little mixture into the prepared tin, then add the mince pies, leaving them whole. Scrape over the rest of the mixture, gently easing it between and over the pies. Level the top. Bake for 25-35 mins until the top has a shiny, papery crust and the sides are just beginning to come away from the tin. Let it cool completely in the tin, then dust with icing sugar and cut into squares",
      "source": "BBC Good Food Brownie Recipes"
    },
    {
      "id": 8,
      "title": "Chocolate orange brownies",
      "image": "./images/choc_orange_8.jpg",
      "ingredient1": "200g butter, chopped",
      "ingredient2": "200g dark chocolate, roughly chopped",
      "ingredient3": "Zest 1 large orange",
      "ingredient4": "4 large eggs",
      "ingredient5": "350g caster sugar",
      "ingredient6": "100g plain flour",
      "ingredient7": "50g cocoa powder",
      "ingredient8": "100g dark chocolate orange, chopped",
      "method": "Heat oven to 180C/160C fan and line a 24 x 20cm square tin with baking paper. Put the butter, dark chocolate and orange zest in a non-stick saucepan and very gently melt over a low heat, stirring every now and then, until smooth – take care not to overheat it. Cool. Whisk the eggs and sugar together with an electric whisk until the mixture is pale, has doubled in volume and leaves a trail when the beaters are lifted. Gently stir into the cooled chocolate mixture. Sift over the flour and cocoa, stir in, then add the orange chocolate. Pour into the lined tin and bake for 35-40 mins. Cool in the tin, then cut into squares.",
      "source": "BBC Good Food Brownie Recipes"
    },
    {
      "id": 9,
      "title": "Brownies",
      "image": "./images/brownies_9.jpg",
      "ingredient1": "375g good quality dark chocolate",
      "ingredient2": "375g butter, cut into pieces",
      "ingredient3": "500g caster sugar",
      "ingredient4": "6 medium eggs",
      "ingredient5": "225g plain flour",
      "ingredient6": "140g good quality dark chocolate",
      "ingredient7": "50g butter, cut into pieces",
      "ingredient8": "Icing sugar for dusting",
      "method": "Butter and line a 30cm x 21cm tin. Preheat the oven to 180C/160C fan. Break up the chocolate with the butter and melt in the microwave on medium for about 5 minutes, stirring halfway through. Beat the sugar and eggs in a bowl. Stir in the melted chocolate, add the flour and beat well. Pour into the tin and bake for 40-45 minutes, or until the top looks papery and feels slightly wobbly. Leave to cool in the tin. If you're making the topping, break up the chocolate with the butter and melt in the microwave on medium for about 1 minute. Stir until smooth then spread over the cake. Dust with icing sugar and cut into squares.",
      "source": "BBC Good Food Brownie Recipes"
    },
    {
      "id": 10,
      "title": "Chocolate raspberry brownies",
      "image": "./images/choc_raspberry_10.jpg",
      "ingredient1": "200g dark chocolate, broken into chunks",
      "ingredient2": "100g milk chocolate, broken into chunks",
      "ingredient3": "250g pack salted butter",
      "ingredient4": "400g soft light brown sugar",
      "ingredient5": "4 large eggs",
      "ingredient6": "140g plain flour",
      "ingredient7": "50g cocoa powder",
      "ingredient8": "200g raspberries",
      "method": "Heat oven to 180C/160C fan. Line a 20 x 30cm baking tray tin with baking paper. Put the chocolate, butter and sugar in a pan and gently melt, stirring occasionally with a wooden spoon. Remove from the heat. Stir the eggs, one by one, into the melted chocolate mixture. Sieve over the flour and cocoa, and stir in. Stir in half the raspberries, scrape into the tray, then scatter over the remaining raspberries. Bake on the middle shelf for 30 mins or, if you prefer a firmer texture, for 5 mins more. Cool before slicing into squares. ",
      "source": "BBC Good Food Brownie Recipes"
    },
    {
      "id": 11,
      "title": "Salted caramel brownies",
      "image": "./images/salted_caramel_11.jpg",
      "ingredient1": "200g unsalted butter, plus extra for greasing",
      "ingredient2": "200g dark chocolate",
      "ingredient3": "397g can caramel",
      "ingredient4": "1 tsp flaky sea salt, plus extra for the top",
      "ingredient5": "200g caster sugar",
      "ingredient6": "4 medium eggs, at room temperature",
      "ingredient7": "130g plain flour",
      "ingredient8": "50g cocoa powder",
      "method": "Heat oven to 180C/160C fan. Grease and line a 23cm square tin. Cut the butter in to cubes, break the chocolate in to pieces and gently melt together in a saucepan. In a small bowl, mix 175g caramel from a 397g can with the sea salt – it will loosen up. Put the rest of the caramel in a large bowl with the caster sugar and 4 medium eggs and beat with an electric hand mixer or balloon whisk until even. Whisk in the chocolate and butter. In another bowl, combine 130g plain flour, 50g cocoa powder and a good pinch of table salt, then sift this on top of the chocolate mix. Beat briefly until smooth. Pour half the brownie batter into the tin and level it with a spatula. Using a teaspoon, spoon half of the salted caramel on top of the batter layer in 5 thick, evenly spaced stripes. Spoon the rest of the brownie batter on top and smooth it out, trying not to disturb the caramel beneath. Top with the rest of the caramel in the same stripy fashion. Drag a skewer or tip of a knife through the caramel to make a feathered pattern on the top. Scatter with a little more sea salt, then bake for 25-30 mins or until risen all the way to the middle with a firm crust on top. When ready, the brownie will jiggle just a little when you shake the tin. Let it cool completely in the tin, then cut into squares.",
      "source": "BBC Good Food Brownie Recipes"
    },
    {
      "id": 12,
      "title": "Chocolate brownies",
      "image": "./images/choc_brownie_12.jpg",
      "ingredient1": "185g unsalted butter",
      "ingredient2": "185g best dark chocolate",
      "ingredient3": "85g plain flour",
      "ingredient4": "40g cocoa powder",
      "ingredient5": "50g white chocolate",
      "ingredient6": "50g milk chocolate",
      "ingredient7": "3 large eggs",
      "ingredient8": "275g caster sugar",
      "method": "Cut butter into cubes and break dark chocolate into small pieces and put in a bowl. Fill a saucepan part way with hot water, then sit the bowl on top so it rests on the rim of the pan, not touching the water. Put over a low heat until the butter and chocolate have melted, stirring occasionally to mix. Remove bowl from the pan. Alternatively, cover the bowl loosely with cling film and put in the microwave for 2 minutes on High. Leave melted mixture to cool to room temperature. While you wait for chocolate to cool turn the oven on to 180C/160C fan and line a 20cm square tin with baking paper. Break eggs into a bowl and tip in caster sugar. With an electric mixer on maximum speed, whisk the eggs and sugar. This can take 3-8 minutes, depending on how powerful your mixer is. You’ll know it’s ready when the mixture becomes really pale and doubles its original volume. Pour the cooled chocolate mixture over the eggy mousse, then gently fold together in a figure of eight movement with a rubber spatula until combined. Sieve the plain flour and cocoa powder over the mixture and fold this into the mixture using the same figure of eight action as before until just combined. Be careful not to overmix. Finally chop the white and milk chocolate into chunks and stir into mixture. Pour the mixture into prepared tin, scraping the bowl with a spatula and then paddle the spatula from side to side across the top to level it. Bake for 25-30 mins until the top has a shiny, papery crust and the sides are just beginning to come away from the tin. Let it cool completely in the tin, then cut into squares.",
      "source": "BBC Good Food Brownie Recipes"
    }
  ],
  "creations": [
    {
      "id": 1,
      "title": "Chocolate Delight",
      "image": "./images/gallery_1.jpg",
      "comments": "Best tasting brownies ever!"
    },
    {
      "id": 2,
      "title": "Homebaked Goodness",
      "image": "./images/gallery_2.jpg",
      "comments": "The family loved these delicious brownies, thank you for the recipe!"
    },
    {
      "title": "Delicious Dessert",
      "image": "./images/gallery_3.jpg",
      "comments": "This was a hit at my dinner party, served with chocolate sauce and cream :)",
      "id": 4
    }
  ]
}